
## Plan Result (infrastructure)

[CI link](https://github.com/nangashi/dcr/actions/runs/7202452087)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * aws_iam_policy.operator
  * aws_iam_role_policy_attachment.developer_operator[0]
  * aws_iam_role_policy_attachment.developer_read_only[0]
* Update
  * aws_iam_role.developer
* Delete
  * aws_iam_role_policy_attachment.developer


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.operator will be created
  + resource "aws_iam_policy" "operator" {
      + arn         = (known after apply)
      + description = "Policy with additional permissions"
      + id          = (known after apply)
      + name        = "Operator-prd"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:PurgeQueue",
                          + "lambda:InvokeFunction",
                          + "datapipeline:ActivatePipeline",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
    }

  # aws_iam_role.developer will be updated in-place
  ~ resource "aws_iam_role" "developer" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                                # (1 unchanged element hidden)
                                "arn:aws:iam::384081048358:user/dev2",
                              + "arn:aws:iam::384081048358:user/dev3",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "Developer-prd"
        name                  = "Developer-prd"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.developer will be destroyed
  # (because aws_iam_role_policy_attachment.developer is not in configuration)
  - resource "aws_iam_role_policy_attachment" "developer" {
      - id         = "Developer-prd-20231212150514595900000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/PowerUserAccess" -> null
      - role       = "Developer-prd" -> null
    }

  # aws_iam_role_policy_attachment.developer_operator[0] will be created
  + resource "aws_iam_role_policy_attachment" "developer_operator" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Developer-prd"
    }

  # aws_iam_role_policy_attachment.developer_read_only[0] will be created
  + resource "aws_iam_role_policy_attachment" "developer_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "Developer-prd"
    }

Plan: 3 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":29,"Program":"tfcmt","SHA1":"7f51684f0de866af4f181d5839b7ad0b0bf9fe5e","Target":"infrastructure","Vars":{},"WorkflowName":"Check Pull Requests"} -->